# –ü—Ä–æ–µ–∫—Ç –ø–æ SQL

**–û–ø–∏—Å–∞–Ω–∏–µ –ø—Ä–æ–µ–∫—Ç–∞**
- –ö–æ—Ä–æ–Ω–∞–≤–∏—Ä—É—Å –∑–∞—Å—Ç–∞–ª –º–∏—Ä –≤—Ä–∞—Å–ø–ª–æ—Ö, –∏–∑–º–µ–Ω–∏–≤ –ø—Ä–∏–≤—ã—á–Ω—ã–π –ø–æ—Ä—è–¥–æ–∫ –≤–µ—â–µ–π. –í —Å–≤–æ–±–æ–¥–Ω–æ–µ –≤—Ä–µ–º—è –∂–∏—Ç–µ–ª–∏ –≥–æ—Ä–æ–¥–æ–≤ –±–æ–ª—å—à–µ –Ω–µ –≤—ã—Ö–æ–¥—è—Ç –Ω–∞ —É–ª–∏—Ü—É, –Ω–µ –ø–æ—Å–µ—â–∞—é—Ç –∫–∞—Ñ–µ –∏ —Ç–æ—Ä–≥–æ–≤—ã–µ —Ü–µ–Ω—Ç—Ä—ã. –ó–∞—Ç–æ —Å—Ç–∞–ª–æ –±–æ–ª—å—à–µ –≤—Ä–µ–º–µ–Ω–∏ –¥–ª—è –∫–Ω–∏–≥. –≠—Ç–æ –∑–∞–º–µ—Ç–∏–ª–∏ —Å—Ç–∞—Ä—Ç–∞–ø–µ—Ä—ã ‚Äî –∏ –±—Ä–æ—Å–∏–ª–∏—Å—å —Å–æ–∑–¥–∞–≤–∞—Ç—å –ø—Ä–∏–ª–æ–∂–µ–Ω–∏—è –¥–ª—è —Ç–µ—Ö, –∫—Ç–æ –ª—é–±–∏—Ç —á–∏—Ç–∞—Ç—å. –í–∞—à–∞ –∫–æ–º–ø–∞–Ω–∏—è —Ä–µ—à–∏–ª–∞ –±—ã—Ç—å –Ω–∞ –≤–æ–ª–Ω–µ –∏ –∫—É–ø–∏–ª–∞ –∫—Ä—É–ø–Ω—ã–π —Å–µ—Ä–≤–∏—Å –¥–ª—è —á—Ç–µ–Ω–∏—è –∫–Ω–∏–≥ –ø–æ –ø–æ–¥–ø–∏—Å–∫–µ. 

**–î–∞–Ω–Ω—ã–µ**
- –î–ª—è –∞–Ω–∞–ª–∏–∑–∞ –¥–∞–Ω–∞ –±–∞–∑–∞ –¥–∞–Ω–Ω—ã—Ö,–≤ –Ω–µ–π ‚Äî –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è –æ –∫–Ω–∏–≥–∞—Ö, –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞—Ö, –∞–≤—Ç–æ—Ä–∞—Ö, –∞ —Ç–∞–∫–∂–µ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏–µ –æ–±–∑–æ—Ä—ã –∫–Ω–∏–≥.

**–¶–µ–ª—å**
- –ü—Ä–æ–∞–Ω–∞–ª–∏–∑–∏—Ä–æ–≤–∞—Ç—å –±–∞–∑—É –¥–∞–Ω–Ω—ã—Ö –∏ —Å—Ñ–æ—Ä–º—É–ª–∏—Ä–æ–≤–∞—Ç—å —Ü–µ–Ω–Ω–æ—Å—Ç–Ω–æ–µ –ø—Ä–µ–¥–ª–æ–∂–µ–Ω–∏–µ –¥–ª—è –Ω–æ–≤–æ–≥–æ –ø—Ä–æ–¥—É–∫—Ç–∞ –¥–ª—è –Ω–æ–≤–æ–≥–æ –ø—Ä–∏–ª–æ–∂–µ–Ω–∏—è —Å —ç–ª–µ–∫—Ç—Ä–æ–Ω–Ω—ã–º–∏ –∫–Ω–∏–≥–∞–º–∏.

**–ó–∞–¥–∞—á–∏**
- 1. –ü–æ—Å—á–∏—Ç–∞—Ç—å, —Å–∫–æ–ª—å–∫–æ –∫–Ω–∏–≥ –≤—ã—à–ª–æ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞;
- 2. –î–ª—è –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏ –ø–æ—Å—á–∏—Ç–∞–π—Ç—å –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É;
- 3. –û–ø—Ä–µ–¥–µ–ª–∏—Ç—å –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ, –∫–æ—Ç–æ—Ä–æ–µ –≤—ã–ø—É—Å—Ç–∏–ª–æ –Ω–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥ —Ç–æ–ª—â–µ 50 —Å—Ç—Ä–∞–Ω–∏—Ü ‚Äî —Ç–∞–∫ –≤—ã –∏—Å–∫–ª—é—á–∏—Ç–µ –∏–∑ –∞–Ω–∞–ª–∏–∑–∞ –±—Ä–æ—à—é—Ä—ã;
- 4. –û–ø—Ä–µ–¥–µ–ª–∏—Ç—å –∞–≤—Ç–æ—Ä–∞ —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ ‚Äî —É—á–∏—Ç—ã–≤–∞–π—Ç–µ —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ —Å 50 –∏ –±–æ–ª–µ–µ –æ—Ü–µ–Ω–∫–∞–º–∏;
- 5. –ü–æ—Å—á–∏—Ç–∞—Ç—å —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 48 –æ—Ü–µ–Ω–æ–∫.

**–•–æ–¥ –∏—Å—Å–ª–µ–¥–æ–≤–∞–Ω–∏—è**
- –ü–æ–¥–∫–ª—é—á–∏–º—Å—è –∫ –±–∞–∑–µ –¥–∞–Ω–Ω—ã—Ö
- –ü—Ä–æ—Å–º–æ—Ç—Ä–∏–º —Ç–∞–±–ª–∏—Ü—ã
- –° –ø–æ–º–æ—â—å—é SQL –∑–∞–ø—Ä–æ—Å–æ–≤ –ø—Ä–æ–∞–Ω–∞–ª–∏–∑–∏—Ä—É–µ–º –¥–∞–Ω–Ω—ã–µ –≤ —Å–æ–æ—Ç–≤–µ—Ç—Å–≤–∏–∏–∏ —Å –∑–∞–¥–∞—á–∞–º–∏
- –í—ã–≤–æ–¥

**–û–ø–∏—Å–∞–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö**

**–¢–∞–±–ª–∏—Ü–∞ books**
–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –∫–Ω–∏–≥–∞—Ö:
- book_id ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- author_id ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∞–≤—Ç–æ—Ä–∞;
- title ‚Äî –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–Ω–∏–≥–∏;
- num_pages ‚Äî –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Å—Ç—Ä–∞–Ω–∏—Ü;
- publication_date ‚Äî –¥–∞—Ç–∞ –ø—É–±–ª–∏–∫–∞—Ü–∏–∏ –∫–Ω–∏–≥–∏;
- publisher_id ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∏–∑–¥–∞—Ç–µ–ª—è.

**–¢–∞–±–ª–∏—Ü–∞ authors**
–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ–± –∞–≤—Ç–æ—Ä–∞—Ö:
- author_id ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∞–≤—Ç–æ—Ä–∞;
- author ‚Äî –∏–º—è –∞–≤—Ç–æ—Ä–∞.

**–¢–∞–±–ª–∏—Ü–∞ publishers**
–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ–± –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞—Ö:
- publisher_id ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞;
- publisher ‚Äî –Ω–∞–∑–≤–∞–Ω–∏–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞;

**–¢–∞–±–ª–∏—Ü–∞ ratings**
–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ—Ü–µ–Ω–∫–∞—Ö –∫–Ω–∏–≥:
- rating_id ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –æ—Ü–µ–Ω–∫–∏;
- book_id ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- username ‚Äî –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –æ—Å—Ç–∞–≤–∏–≤—à–µ–≥–æ –æ—Ü–µ–Ω–∫—É;
- rating ‚Äî –æ—Ü–µ–Ω–∫–∞ –∫–Ω–∏–≥–∏.

**–¢–∞–±–ª–∏—Ü–∞ reviews**
–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ–±–∑–æ—Ä–∞—Ö:
- review_id ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –æ–±–∑–æ—Ä–∞;
- book_id ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- username ‚Äî –∏–º—è –∞–≤—Ç–æ—Ä–∞ –æ–±–∑–æ—Ä–∞;
- text ‚Äî —Ç–µ–∫—Å—Ç –æ–±–∑–æ—Ä–∞.

### –ò–º–ø–æ—Ä—Ç –±–∏–±–ª–∏–æ—Ç–µ–∫ –∏ –ø–æ–¥–∫–ª—é—á–µ–Ω–∏–µ –∫ –±–∞–∑–µ –¥–∞–Ω–Ω—ã—Ö

In [1]:
# –∏–º–ø–æ—Ä—Ç–∏—Ä—É–µ–º –±–∏–±–ª–∏–æ—Ç–µ–∫–∏
import pandas as pd
from sqlalchemy import text, create_engine

In [2]:
# —É—Å—Ç–∞–Ω–∞–≤–ª–∏–≤–∞–µ–º –ø–∞—Ä–∞–º–µ—Ç—Ä—ã
db_config = {'user': 'praktikum_student', # –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è
'pwd': 'Sdf4$2;d-d30pp', # –ø–∞—Ä–æ–ª—å
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # –ø–æ—Ä—Ç –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è
'db': 'data-analyst-final-project-db'} # –Ω–∞–∑–≤–∞–Ω–∏–µ –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö
connection_string = 'postgresql://{user}:{pwd}@{host}:{port}/{db}'.format(**db_config)
# —Å–æ—Ö—Ä–∞–Ω—è–µ–º –∫–æ–Ω–Ω–µ–∫—Ç–æ—Ä
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

### –ü—Ä–æ—Å–º–æ—Ç—Ä —Å–æ–¥–µ—Ä–∂–∞–Ω–∏—è —Ç–∞–±–ª–∏—Ü

- –¢–∞–±–ª–∏—Ü–∞ books

In [3]:
# —á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query = '''SELECT * FROM books LIMIT 3'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135

In [4]:
# —á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query = '''SELECT column_name, column_default, data_type FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name = 'books' '''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

        column_name column_default data_type
0           book_id           None   integer
1         author_id           None   integer
2         num_pages           None   integer
3  publication_date           None      date
4      publisher_id           None   integer
5             title           None      text

–í—Å–µ –≤ –ø–æ—Ä—è–¥–∫–µ. –ü—Ä–æ–ø—É—Å–∫–æ–≤ –Ω–µ—Ç, —Ñ–æ—Ä–º–∞—Ç—ã –¥–∞–Ω–Ω—ã—Ö –∫–æ—Ä—Ä–µ–∫—Ç–Ω—ã, —Ç–æ–ª—å–∫–æ –≤–º–µ—Å—Ç–æ varchar - text (–≤–∏–¥–∏–º–æ, —á—Ç–æ–±—ã –Ω–µ –±—ã–ª–æ –æ–≥—Ä–∞–Ω–∏—á–µ–Ω–∏–π –ø–æ –¥–ª–∏–Ω–µ –≤ —Å—Ç—Ä–æ–∫–µ), —ç—Ç–æ –Ω–µ –∫—Ä–∏—Ç–∏—á–Ω–æ. –£ –∫–æ–ª–æ–Ω–∫–∏ publication_date —Ñ–æ—Ä–º–∞—Ç date, –Ω–µ datetime, –∫–∞–∫ –∑–∞—è–≤–ª–µ–Ω–æ

- –¢–∞–±–ª–∏—Ü–∞ authors

In [5]:
# —á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query = '''SELECT * FROM authors LIMIT 3'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie

In [6]:
# —Ç–∏–ø –¥–∞–Ω–Ω—ã—Ö –∏ –ø—Ä–æ–ø—É—Å–∫–∏
query = '''SELECT column_name, column_default, data_type FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name = 'authors' '''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

  column_name column_default data_type
0   author_id           None   integer
1      author           None      text

–í—Å–µ –≤ –ø–æ—Ä—è–¥–∫–µ. –ü—Ä–æ–ø—É—Å–∫–æ–≤ –Ω–µ—Ç, —Ñ–æ—Ä–º–∞—Ç—ã –¥–∞–Ω–Ω—ã—Ö –∫–æ—Ä—Ä–µ–∫—Ç–Ω—ã, —Å–Ω–æ–≤–∞ –≤–º–µ—Å—Ç–æ varchar->text. –ù–µ –∫—Ä–∏—Ç–∏—á–Ω–æ.

- –¢–∞–±–ª–∏—Ü–∞ ratings

In [7]:
# —á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query = '''SELECT * FROM ratings LIMIT 3'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5

In [8]:
# —Ç–∏–ø –¥–∞–Ω–Ω—ã—Ö –∏ –ø—Ä–æ–ø—É—Å–∫–∏
query = '''SELECT column_name, column_default, data_type FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name = 'ratings' '''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

  column_name column_default data_type
0   rating_id           None   integer
1     book_id           None   integer
2      rating           None   integer
3    username           None      text

–í—Å–µ –≤ –ø–æ—Ä—è–¥–∫–µ

- –¢–∞–±–ª–∏—Ü–∞ reviews

In [9]:
# —á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query = '''SELECT * FROM reviews LIMIT 3'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...

In [10]:
# —Ç–∏–ø –¥–∞–Ω–Ω—ã—Ö –∏ –ø—Ä–æ–ø—É—Å–∫–∏
query = '''SELECT column_name, column_default, data_type FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name = 'reviews' '''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

  column_name column_default data_type
0   review_id           None   integer
1     book_id           None   integer
2    username           None      text
3        text           None      text

–í—Å–µ –≤ –ø–æ—Ä—è–¥–∫–µ

- –¢–∞–±–ª–∏—Ü–∞ publishers

In [11]:
# —á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query = '''SELECT * FROM publishers LIMIT 3'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

   publisher_id  publisher
0             1        Ace
1             2   Ace Book
2             3  Ace Books

In [12]:
# —Ç–∏–ø –¥–∞–Ω–Ω—ã—Ö –∏ –ø—Ä–æ–ø—É—Å–∫–∏
query = '''SELECT column_name, column_default, data_type FROM INFORMATION_SCHEMA.COLUMNS WHERE table_name = 'publishers' '''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query), con = con)

    column_name column_default data_type
0  publisher_id           None   integer
1     publisher           None      text

**–í—ã–≤–æ–¥ –ø–æ –ø—Ä–æ—Å–º–æ—Ç—Ä—É –¥–∞–Ω–Ω—ã—Ö** –° –¥–∞–Ω–Ω—ã–º–∏ –≤—Å–µ –≤ –ø–æ—Ä—è–¥–∫–µ, –ø—Ä–æ–ø—É—Å–∫–æ–≤ –Ω–µ—Ç, —Å—Ç–æ–ª–±—Ü—ã —Å–æ–æ—Ç–≤–µ—Ç—Å–≤—É—é—Ç –∑–∞—è–≤–ª–µ–Ω–Ω—ã–º. –° —Ç–∏–ø–∞–º–∏ –¥–∞–Ω–Ω—ã—Ö —Ç–æ–∂–µ –≤—Å–µ –≤ –ø–æ—Ä—è–¥–∫–µ. –°—Ç–æ–ª–±—Ü—ã —Å —Ç–µ–∫—Å—Ç–æ–º –∏–º–µ—é—Ç —Ñ–æ—Ä–º–∞—Ç text –≤–º–µ—Å—Ç–æ varchar (–≤–∏–¥–∏–º–æ, –∏–∑-–∑–∞ –±–æ–ª—å—à–æ–π –¥–ª–∏–Ω—ã —Å—Ç—Ä–æ–∫–∏)

### –ê–Ω–∞–ª–∏–∑ –¥–∞–Ω–Ω—ã—Ö
- **–ü–æ—Å—á–∏—Ç–∞–µ–º, —Å–∫–æ–ª—å–∫–æ –∫–Ω–∏–≥ –≤—ã—à–ª–æ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞**

In [13]:
# —á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query_1 = '''SELECT COUNT(DISTINCT book_id) FROM books b WHERE CAST(publication_date AS date) > '2000-01-01' '''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query_1), con = con)

   count
0    819

–° —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞ –±—ã–ª–æ –∏–∑–¥–∞–Ω–æ –≤—Å–µ–≥–æ 819 –∫–Ω–∏–≥

- **–î–ª—è –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏ –ø–æ—Å—á–∏—Ç–∞–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É**

In [14]:
# —á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query_2 = '''SELECT title, reviews, avg_rating FROM books as b
LEFT JOIN (SELECT book_id, COUNT(review_id) as reviews 
FROM reviews GROUP BY  book_id) as rev ON b.book_id=rev.book_id
LEFT JOIN (SELECT book_id,  ROUND(AVG(rating),2) as avg_rating 
FROM ratings GROUP BY book_id ) as rat ON b.book_id=rat.book_id 
LIMIT 10'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query_2), con = con)

                                               title  reviews  avg_rating
0          The Body in the Library (Miss Marple  #3)        2        4.50
1                                          Gal√°pagos        2        4.50
2                           A Tree Grows in Brooklyn        5        4.25
3  Undaunted Courage: The Pioneering First Missio...        2        4.00
4                                        The Prophet        4        4.29
5                  American Gods (American Gods  #1)        5        4.00
6            Influence: The Psychology of Persuasion        3        4.33
7                                          The Idiot        3        4.25
8                                            Rebecca        4        4.00
9                                         The Source        2        3.50

In [15]:
#–º–∏–Ω–∏–º–∞–ª—å–Ω—ã–π —Ä–µ–π—Ç–∏–Ω–≥ –∫–Ω–∏–≥
query_2_1 = '''SELECT title, reviews, avg_rating FROM books as b
LEFT JOIN (SELECT book_id, COUNT(review_id) as reviews 
FROM reviews GROUP BY  book_id) as rev ON b.book_id=rev.book_id
LEFT JOIN (SELECT book_id,  ROUND(AVG(rating),2) as avg_rating 
FROM ratings GROUP BY book_id ) as rat ON b.book_id=rat.book_id
ORDER BY avg_rating
LIMIT 2'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query_2_1), con = con)

                               title  reviews  avg_rating
0               Harvesting the Heart        2         1.5
1  His Excellency: George Washington        2         2.0

In [16]:
#–º–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤
query_2_2 = '''SELECT book_id, COUNT(review_id) FROM reviews GROUP BY book_id ORDER BY COUNT(review_id) DESC LIMIT 1'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query_2_2), con = con)

   book_id  count
0      948      7

In [17]:
#–º–∏–Ω–∏–º–∞–ª—å–Ω–æ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤
query_2_3 = '''SELECT book_id, COUNT(review_id) FROM reviews GROUP BY book_id ORDER BY COUNT(review_id) LIMIT 1'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query_2_3), con = con)

   book_id  count
0      638      1

- –ú—ã —Å–æ–∑–¥–∞–ª–∏ —Ç–∞–±–ª–∏—Ü—É —Å –Ω–∞–∑–≤–∞–Ω–∏—è–º–∏ –∫–Ω–∏–≥ –∏ —Å—Ä–µ–¥–Ω–∏–º —Ä–µ–π—Ç–∏–Ω–≥–æ–º –∏ –æ–±—â–∏–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –æ–±–∑–æ—Ä–æ–≤. –û–ø–∏—Ä–∞—è—Å—å –Ω–∞ —ç—Ç–∏ –¥–∞–Ω–Ω—ã–µ, –º–æ–∂–Ω–æ –æ–ø—Ä–µ–¥–µ–ª–∏—Ç—å —Å–ø–∏—Å–æ–∫ –¢–û–ü —Å–∞–º—ã—Ö –ø–æ–ø—É–ª—è—Ä–Ω—ã—Ö –∫–Ω–∏–≥ —Å—Ä–µ–¥–∏ —á–∏—Ç–∞—Ç–µ–ª–µ–π, —á—Ç–æ–±—ã –≤–∫–ª—é—á–∏—Ç—å –∏—Ö –≤ —Å–≤–æ—é –±–∞–∑—É. 
- –ú–∏–Ω–∏–º–∞–ª—å–Ω–æ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –Ω–∞ –∫–Ω–∏–≥—É - 1, –º–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–µ 7, —Ä–µ–π—Ç–∏–Ω–≥ –æ—Ç 1.5 –¥–æ 5 –±–∞–ª–ª–æ–≤. –¢–æ –µ—Å—Ç—å –Ω–∏ –æ–¥–Ω–∞ –∫–Ω–∏–≥–∞, –¥–∞–∂–µ —Å —Å–∞–º—ã–º –Ω–∏–∑–∫–∏–º —Ä–µ–π—Ç–∏–Ω–≥–æ–º –Ω–µ –æ—Å—Ç–∞–ª–∞—Å—å –±–µ–∑ –æ–±–∑–æ—Ä–∞ —á–∏—Ç–∞—Ç–µ–ª—è. –£—á–∏—Ç—ã–≤–∞—è —ç—Ç–æ –ø—Ä–∏ —Ä–∞–∑—Ä–∞–±–æ—Ç–∫–µ –Ω—É–∂–Ω–æ –æ–±—è–∑–∞—Ç–µ–ª—å–Ω–æ –≤–∫–ª—é—á–∏—Ç—å –æ—Ç–∑—ã–≤—ã/—Ä–∞–∑–¥–µ–ª—ã —Ä–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏–∏/—Ä–µ–π—Ç–∏–Ω–≥–∏.

- **–û–ø—Ä–µ–¥–µ–ª–∏–º –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ, –∫–æ—Ç–æ—Ä–æ–µ –≤—ã–ø—É—Å—Ç–∏–ª–æ –Ω–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥ —Ç–æ–ª—â–µ 50 —Å—Ç—Ä–∞–Ω–∏—Ü ‚Äî —Ç–∞–∫ –º—ã –∏—Å–∫–ª—é—á–∏–º –∏–∑ –∞–Ω–∞–ª–∏–∑–∞ –±—Ä–æ—à—é—Ä—ã**

In [18]:
# —á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query_3 = '''SELECT p.publisher, COUNT(b.book_id) as total_books
FROM books as b
LEFT JOIN publishers as p ON b.publisher_id = p.publisher_id
WHERE num_pages > 50
GROUP BY publisher
ORDER BY total_books DESC
LIMIT 1'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query_3), con = con)

       publisher  total_books
0  Penguin Books           42

–°–∞–º–æ–µ –ø—Ä–æ–¥—É–∫—Ç–∏–≤–Ω–æ–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ Penguin Books, –∫–æ—Ç–æ—Ä–æ–µ –∏–∑–¥–∞–ª–æ 42 –∫–Ω–∏–≥–∏. –í —Ä–∞—Å—á–µ—Ç –±—ã–ª–∏ –≤–∑—è—Ç—ã —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ 50+ —Å—Ç—Ä–∞–Ω–∏—Ü, —á—Ç–æ–±—ã –∏—Å–∫–ª—é—á–∏—Ç—å –∏–∑ —Ä–∞—Å—á–µ—Ç–∞ –±—Ä–æ—à—é—Ä—ã.

 
- **–û–ø—Ä–µ–¥–µ–ª–∏–º –∞–≤—Ç–æ—Ä–∞ —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ ‚Äî —É—á–∏—Ç—ã–≤–∞–µ–º —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ —Å 50 –∏ –±–æ–ª–µ–µ –æ—Ü–µ–Ω–∫–∞–º–∏**

In [19]:
# —á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query_4 = '''SELECT author, AVG(rating) as rating FROM books as b
RIGHT JOIN (SELECT book_id
            FROM ratings
            GROUP BY book_id 
            HAVING COUNT(rating_id) > 49) as lim ON b.book_id=lim.book_id
LEFT JOIN authors a ON b.author_id = a.author_id
LEFT JOIN ratings r ON r.book_id = b.book_id
GROUP BY author
ORDER BY rating DESC 
LIMIT 1 '''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query_4), con = con)

                       author    rating
0  J.K. Rowling/Mary GrandPr√©  4.287097

J.K. Rowling —Å–∞–º—ã–π –ø–æ–ø—É–ª—è—Ä–Ω—ã–π –ø–∏—Å–∞—Ç–µ–ª—å —Å –≤—ã—Å–æ–∫–∏–º–∏ –æ—Ü–µ–Ω–∫–∞–º–∏, –∞ –∑–Ω–∞—á–∏—Ç –≤—Å–µ –∫–Ω–∏–≥–∏ –ì–∞—Ä—Ä–∏ –ü–æ—Ç—Ç–µ—Ä–∞ –æ–±—è–∑–∞—Ç–µ–ª—å–Ω–æ –¥–æ–ª–∂–Ω—ã –±—ã—Ç—å –≤–∫–ª—é—á–µ–Ω—ã.

<div class="alert alert-success">
<h2> –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π —Ä–µ–≤—å—é–µ—Ä–∞ <a class="tocSkip"> </h2>

<b>–í—Å–µ –æ—Ç–ª–∏—á–Ω–æ!üëç:</b> –ê–≤—Ç–æ—Ä —Å —Å–∞–º—ã–º –≤—ã—Å–æ–∫–∏–º —Å—Ä–µ–¥–Ω–∏–º —Ä–µ–π—Ç–∏–Ω–≥–æ–º –Ω–∞–π–¥–µ–Ω –≤–µ—Ä–Ω–æ! –ö–ª–∞—Å—Å–Ω–æ, —á—Ç–æ –¥–æ–ø–æ–ª–Ω–∏—Ç–µ–ª—å–Ω–æ –≤—ã–≤–µ–¥–µ–Ω —Å–∞–º —Å—Ä–µ–¥–Ω–∏–π —Ä–µ–π—Ç–∏–Ω–≥ - –∏–º–µ–Ω–Ω–æ –≤ –µ–≥–æ —Ä–∞—Å—á—ë—Ç–µ –æ–±—ã—á–Ω–æ –¥–µ–ª–∞—é—Ç –æ—à–∏–±–∫–∏:)

</div>

- **–ü–æ—Å—á–∏—Ç–∞–µ–º —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 48 –æ—Ü–µ–Ω–æ–∫.**

In [20]:
#—á—Ç–æ–±—ã –≤—ã–ø–æ–ª–Ω–∏—Ç—å SQL-–∑–∞–ø—Ä–æ—Å, –∏—Å–ø–æ–ª—å–∑—É–µ–º Pandas
query_5 = '''WITH users as 
(SELECT rev.username , count(review_id) as review
 FROM reviews AS rev
 RIGHT JOIN (SELECT username
             FROM ratings
             GROUP BY username HAVING COUNT(rating_id) > 48) AS rat ON rev.username = rat.username
GROUP BY rev.username)
SELECT AVG(review) from users'''
con=engine.connect()
pd.io.sql.read_sql(sql=text(query_5), con = con)

    avg
0  24.0

–ü–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–∏, –∫–æ—Ç–æ—Ä—ã–µ –æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª–µ–µ 48 –æ—Ü–µ–Ω–æ–∫, –Ω–∞–ø–∏—Å–∞–ª–∏ –æ—Ç–∑—ã–≤-–æ–±–∑–æ—Ä –≤ —Å—Ä–µ–¥–Ω–µ–º –æ 24 –∫–Ω–∏–≥–∞—Ö. –û—Ü–µ–Ω–∫—É –º–æ–∂–Ω–æ –ø–æ—Å—Ç–∞–≤–∏—Ç—å –∫–Ω–∏–≥–µ, –∫–æ—Ç–æ—Ä—É—é –Ω–µ —á–∏—Ç–∞–ª, –Ω–æ –æ–±–∑–æ—Ä —Å–æ—Å—Ç–∞–≤–∏—Ç—å –Ω–∞ —Ç–æ, —á—Ç–æ –Ω–µ —á–∏—Ç–∞–ª - –Ω–µ –≤–æ–∑–º–æ–∂–Ω–æ. –ü–æ—ç—Ç–æ–º—É –º–æ–∂–Ω–æ —Å—á–∏—Ç–∞—Ç—å, —á—Ç–æ –≤ —Å—Ä–µ–¥–Ω–µ–º –∞–∫—Ç–∏–≤–Ω—ã–µ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–∏ –ø—Ä–æ—á–ª–∏ 24 –∫–Ω–∏–≥–∏.

<div class="alert alert-success">
<h2> –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π —Ä–µ–≤—å—é–µ—Ä–∞ <a class="tocSkip"> </h2>

<b>–í—Å–µ –æ—Ç–ª–∏—á–Ω–æ!üëç:</b> –°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 48 –æ—Ü–µ–Ω–æ–∫, –ø–æ—Å—á–∏—Ç–∞–Ω–æ –≤–µ—Ä–Ω–æ!

### –í—ã–≤–æ–¥

- –ú—ã —Å–æ–∑–¥–∞–ª–∏ —Ç–∞–±–ª–∏—Ü—É —Å –Ω–∞–∑–≤–∞–Ω–∏—è–º–∏ –∫–Ω–∏–≥ –∏ —Å—Ä–µ–¥–Ω–∏–º —Ä–µ–π—Ç–∏–Ω–≥–æ–º –∏ –æ–±—â–∏–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –æ–±–∑–æ—Ä–æ–≤. –û–ø–∏—Ä–∞—è—Å—å –Ω–∞ —ç—Ç–∏ –¥–∞–Ω–Ω—ã–µ, –º–æ–∂–Ω–æ –æ–ø—Ä–µ–¥–µ–ª–∏—Ç—å —Å–ø–∏—Å–æ–∫ –¢–û–ü —Å–∞–º—ã—Ö –ø–æ–ø—É–ª—è—Ä–Ω—ã—Ö –∫–Ω–∏–≥ —Å—Ä–µ–¥–∏ —á–∏—Ç–∞—Ç–µ–ª–µ–π, —á—Ç–æ–±—ã –≤–∫–ª—é—á–∏—Ç—å –∏—Ö –≤ —Å–≤–æ—é –±–∞–∑—É.
- –° —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞ –±—ã–ª–æ –∏–∑–¥–∞–Ω–æ –≤—Å–µ–≥–æ 819 –∫–Ω–∏–≥
- –ú–∏–Ω–∏–º–∞–ª—å–Ω–æ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –Ω–∞ –∫–Ω–∏–≥—É - 1, –º–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–µ 7, —Ä–µ–π—Ç–∏–Ω–≥ –æ—Ç 1.5 –¥–æ 5 –±–∞–ª–ª–æ–≤. –¢–æ –µ—Å—Ç—å –Ω–∏ –æ–¥–Ω–∞ –∫–Ω–∏–≥–∞, –¥–∞–∂–µ —Å —Å–∞–º—ã–º –Ω–∏–∑–∫–∏–º —Ä–µ–π—Ç–∏–Ω–≥–æ–º –Ω–µ –æ—Å—Ç–∞–ª–∞—Å—å –±–µ–∑ –æ–±–∑–æ—Ä–∞ —á–∏—Ç–∞—Ç–µ–ª—è. –£—á–∏—Ç—ã–≤–∞—è —ç—Ç–æ –ø—Ä–∏ —Ä–∞–∑—Ä–∞–±–æ—Ç–∫–µ –Ω—É–∂–Ω–æ –æ–±—è–∑–∞—Ç–µ–ª—å–Ω–æ –≤–∫–ª—é—á–∏—Ç—å –æ—Ç–∑—ã–≤—ã/—Ä–∞–∑–¥–µ–ª—ã —Ä–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏–∏/—Ä–µ–π—Ç–∏–Ω–≥–∏.
- –°–∞–º–æ–µ –ø—Ä–æ–¥—É–∫—Ç–∏–≤–Ω–æ–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ Penguin Books, –∫–æ—Ç–æ—Ä–æ–µ –∏–∑–¥–∞–ª–æ 42 –∫–Ω–∏–≥–∏. –í —Ä–∞—Å—á–µ—Ç –±—ã–ª–∏ –≤–∑—è—Ç—ã —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ 50+ —Å—Ç—Ä–∞–Ω–∏—Ü, —á—Ç–æ–±—ã –∏—Å–∫–ª—é—á–∏—Ç—å –∏–∑ —Ä–∞—Å—á–µ—Ç–∞ –±—Ä–æ—à—é—Ä—ã.
- J.K. Rowling —Å–∞–º—ã–π –ø–æ–ø—É–ª—è—Ä–Ω—ã–π –ø–∏—Å–∞—Ç–µ–ª—å —Å –≤—ã—Å–æ–∫–∏–º–∏ –æ—Ü–µ–Ω–∫–∞–º–∏, –∞ –∑–Ω–∞—á–∏—Ç –≤—Å–µ –∫–Ω–∏–≥–∏ –ì–∞—Ä—Ä–∏ –ü–æ—Ç—Ç–µ—Ä–∞ –æ–±—è–∑–∞—Ç–µ–ª—å–Ω–æ –¥–æ–ª–∂–Ω—ã –±—ã—Ç—å –≤–∫–ª—é—á–µ–Ω—ã.
- –°–∞–º—ã–µ –∞–∫—Ç–∏–≤–Ω—ã–µ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–∏, –∫–æ—Ç–æ—Ä—ã–µ –æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª–µ–µ 48 –æ—Ü–µ–Ω–æ–∫, –Ω–∞–ø–∏—Å–∞–ª–∏ –æ—Ç–∑—ã–≤-–æ–±–∑–æ—Ä –≤ —Å—Ä–µ–¥–Ω–µ–º –æ 24 –∫–Ω–∏–≥–∞—Ö. –û—Ü–µ–Ω–∫—É –º–æ–∂–Ω–æ –ø–æ—Å—Ç–∞–≤–∏—Ç—å –∫–Ω–∏–≥–µ, –∫–æ—Ç–æ—Ä—É—é –Ω–µ —á–∏—Ç–∞–ª, –Ω–æ –æ–±–∑–æ—Ä —Å–æ—Å—Ç–∞–≤–∏—Ç—å –Ω–∞ —Ç–æ, —á—Ç–æ –Ω–µ —á–∏—Ç–∞–ª - –Ω–µ –≤–æ–∑–º–æ–∂–Ω–æ. –ü–æ—ç—Ç–æ–º—É –º–æ–∂–Ω–æ —Å—á–∏—Ç–∞—Ç—å, —á—Ç–æ –≤ —Å—Ä–µ–¥–Ω–µ–º –∞–∫—Ç–∏–≤–Ω—ã–µ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–∏ –ø—Ä–æ—á–ª–∏ 24 –∫–Ω–∏–≥–∏.

**–¶–µ–Ω–Ω–æ—Å—Ç–Ω–æ–µ –ø—Ä–µ–¥–ª–æ–∂–µ–Ω–∏–µ**
- –ü—Ä–æ–≤–µ—Å—Ç–∏ –∞–Ω–∞–ª–∏–∑ –∏ –≤—ã—è–≤–∏—Ç—å —Ç–æ, —á—Ç–æ –ø–æ–ª—å–∑—É–µ—Ç—Å—è —Å–ø—Ä–æ—Å–æ–º —É —á–∏—Ç–∞—Ç–µ–ª–µ–π –≤ –Ω–∞—à–µ –≤—Ä–µ–º—è, —á—Ç–æ–±—ã –≤–∫–ª—é—á–∏—Ç—å —ç—Ç–æ –≤ —Å–≤–æ–µ –ø—Ä–∏–ª–æ–∂–µ–Ω–∏–µ (–≤—ã—è–≤–∏—Ç—å –ø–æ–ø—É–ª—è—Ä–Ω—ã–µ –∫–Ω–∏–≥, –∞–≤—Ç–æ—Ä–æ–≤ –∏ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤ –Ω–∞ –æ—Å–Ω–æ–≤–µ —Ä–µ–π—Ç–∏–Ω–≥–æ–≤ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π)

<div class="alert alert-success">
<h2> –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π —Ä–µ–≤—å—é–µ—Ä–∞ <a class="tocSkip"> </h2>

<b>–í—Å–µ –æ—Ç–ª–∏—á–Ω–æ!üëç:</b> –û—Ç–ª–∏—á–Ω—ã–π –∏—Ç–æ–≥–æ–≤—ã–π –≤—ã–≤–æ–¥ –ø–æ –ø—Ä–æ–µ–∫—Ç—É!

<div style="border:solid Chocolate 2px; padding: 40px">

# –ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π —Ä–µ–≤—å—é–µ—Ä–∞: –æ–±—â–∏–π –≤—ã–≤–æ–¥ –ø–æ –ø—Ä–æ–µ–∫—Ç—É.

–ï–∫–∞—Ç–µ—Ä–∏–Ω–∞, –æ—Ç–ª–∏—á–Ω–∞—è —Ä–∞–±–æ—Ç–∞ –Ω–∞–¥ –ø—Ä–æ–µ–∫—Ç–æ–º - –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è —É —Ç–µ–±—è –≤—ã–ø–æ–ª–Ω–µ–Ω—ã –≤–µ—Ä–Ω–æ!

–ú–Ω–µ –Ω—Ä–∞–≤–∏—Ç—Å—è —Ç–≤–æ–π –∞–Ω–∞–ª–∏—Ç–∏—á–µ—Å–∫–∏–π –ø–æ–¥—Ö–æ–¥ –∫ –≤—ã–ø–æ–ª–Ω–µ–Ω–∏—é –ø—Ä–æ–µ–∫—Ç–∞, —Ç—ã —Å–æ–±–ª—é–¥–∞–µ—à—å —Å—Ç—Ä—É–∫—Ç—É—Ä—É —Ä–∞–±–æ—Ç—ã, –≤—ã–ø–æ–ª–Ω—è–µ—à—å –µ—ë –ø–æ—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å–Ω–æ - —ç—Ç–æ –æ—á–µ–Ω—å —Ö–æ—Ä–æ—à–æ! –®–∞–≥–∏ –ø—Ä–æ–µ–∫—Ç–∞ –≤—ã–ø–æ–ª–Ω–µ–Ω—ã –ø–æ –ø–æ—Ä—è–¥–∫—É —Å–æ–≥–ª–∞—Å–Ω–æ –ø–ª–∞–Ω—É –ø—Ä–æ–µ–∫—Ç–∞, –Ω–µ—Ç —Å–º—ã—Å–ª–æ–≤—ã—Ö –∏ —Å—Ç—Ä—É–∫—Ç—É—Ä–Ω—ã—Ö —è–º. –í–∞–∂–Ω–æ, —á—Ç–æ –Ω–µ –∑–∞–±—ã–≤–∞–µ—à—å –ø—Ä–æ –≤—ã–≤–æ–¥—ã.
    
SQL –∑–∞–ø—Ä–æ—Å—ã –Ω–∞–ø–∏—Å–∞–Ω—ã —Ö–æ—Ä–æ—à–æ –∏ –æ–ø—Ç–∏–º–∞–ª—å–Ω–æ, –≤ –Ω–∏—Ö –Ω–µ—Ç –∏–∑–±—ã—Ç–æ—á–Ω—ã—Ö –¥–µ–π—Å—Ç–≤–∏–π, –æ–Ω–∏ –≤–æ–∑–≤—Ä–∞—â–∞—é—Ç –≤–µ—Ä–Ω—ã–π —Ä–µ–∑—É–ª—å—Ç–∞—Ç - —ç—Ç–æ –∑–¥–æ—Ä–æ–≤–æ, –∫–∞–∂–µ—Ç—Å—è, —Ç–µ–±–µ —É–¥–∞–ª–æ—Å—å –∑–¥–æ—Ä–æ–≤–æ —Ä–∞–∑–æ–±—Ä–∞—Ç—å—Å—è –≤ —Ç–µ–º–µ.
    
–ï—Å—Ç—å –Ω–µ–±–æ–ª—å—à–∏–µ —Ä–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏–∏ –ø–æ —É–ª—É—á—à–µ–Ω–∏—é –ø—Ä–æ–µ–∫—Ç–∞ - –Ω–µ–∫—Ä–∏—Ç–∏—á–Ω–∞—è –º–µ–ª–æ—á—å, –∫–æ—Ç–æ—Ä–∞—è –Ω–µ –∑–∞–π–º—ë—Ç –º–Ω–æ–≥–æ –≤—Ä–µ–º–µ–Ω–∏, –Ω–æ —Å–¥–µ–ª–∞–µ—Ç —Ç–≤–æ–π –ø—Ä–æ–µ–∫—Ç —Å—Ç–∏–ª–∏—Å—Ç–∏—á–µ—Å–∫–∏ –±–æ–ª–µ–µ —Å–æ–≤–µ—Ä—à–µ–Ω–Ω—ã–º. –ë—É–¥–µ—Ç –∫–ª–∞—Å—Å–Ω–æ, –µ—Å–ª–∏ —ç—Ç–∏ —Ä–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏–∏ –±—É–¥—É—Ç —É—á—Ç–µ–Ω—ã –≤ —Ç–≤–æ–µ–π —Ä–∞–±–æ—Ç–µ:) –≠—Ç–∏ –∑–∞–º–µ—á–∞–Ω–∏—è –º–æ–∂–Ω–æ —É—á–µ—Å—Ç—å —Å–∞–º–æ—Å—Ç–æ—è—Ç–µ–ª—å–Ω–æ –ø—Ä–∏ –æ—Ñ–æ—Ä–º–ª–µ–Ω–∏–∏ –ø—Ä–æ–µ–∫—Ç–∞ –¥–ª—è —Ç–≤–æ–µ–≥–æ –ø–æ—Ä—Ç—Ñ–æ–ª–∏–æ.
    
–°–ø–∞—Å–∏–±–æ –∑–∞ —Ä–∞–±–æ—Ç—É –Ω–∞–¥ –ø—Ä–æ–µ–∫—Ç–æ–º, –∂–µ–ª–∞—é –ø—Ä–∏—è—Ç–Ω–æ–≥–æ –∑–∞–≤–µ—Ä—à–µ–Ω–∏—è —Ñ–∏–Ω–∞–ª—å–Ω–æ–≥–æ —Å–ø—Ä–∏–Ω—Ç–∞:)